W6D4/first_routes/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        artworks_owned = Artwork.find_by(artist_id: params[:user_id])
        artworks_shared = User.find(params[:user_id]).shared_artworks