W6D4/first_routes/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 2], ["LIMIT", 1]]
---
    def index
        if params[:user_id]
            comments = Comment.find_by(user_id: params[:user_id])
        elsif params[:artwork_id]
            comments = Comment.find_by(artwork_id: params[:artwork_id])