W6D4/first_routes/app/controllers/users_controller.rb

    def index
        if !params[:query]
            users = User.all
            render json: users
        else
            user = User.find_by(username: params[:query])
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Bill"], ["LIMIT", 1]]

    def update
        user = User.find(params[:id])
        user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "'shampoo@hotmail.com'"], ["updated_at", "2020-07-08 22:17:12.202430"], ["id", 3]]

    def destroy
        user = User.find(params[:id])
        user.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]