W7D2/music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def self.find_by_credentials(email, password) # S
        user = User.find_by(email: email)

UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "bt1AovD1wmODQR_hzLG0cg"], ["updated_at", "2020-07-14 21:39:53.464625"], ["id", 1]]
---
    def reset_session_token! # R
        self.session_token = SecureRandom.urlsafe_base64
        self.save!