W8D1/reddit_clone/reddit_clone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        # @post[:sub_ids] = params[:post][:sub_ids].map(&:to_i)

        debugger
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hi"], ["url", ""], ["content", "hello"], ["author_id", 5], ["created_at", "2020-07-20 23:25:06.868542"], ["updated_at", "2020-07-20 23:25:06.868542"]]