W7D2/music_app/app/controllers/sessions_controller.rb

    def destroy
        @user = User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "wq_yyQPhJ9ovl6kYjmlZLA"], ["LIMIT", 1]]