W8D1/reddit_clone/reddit_clone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
  <label>Select Subs to Post to:
    <% Sub.all.each do |sub| %>